#+title: Definite Clause Gramatike
#+author: Mislav Zanic

*** Aritmetika u N (djelomicna barem)
#+begin_src prolog :tangle ./aritmetika_N.pl :session :goal izraz([otv,otv,2,2,3,+,3,zatv,*,4,zatv,^,5],[])
  izraz --> clan,plus,izraz.
  izraz --> clan.
  clan --> faktor,puta,clan.
  clan --> faktor.
  faktor --> baza,na,faktor.
  faktor --> baza.
  baza --> broj.
  baza --> otv,izraz,zatv.

  plus --> [+].
  puta --> [*].
  na --> [^].
  otv --> ['('].
  zatv --> [')'].

  broj --> [0].
  broj --> [1],pbroj.
  broj --> [2],pbroj.
  broj --> [3],pbroj.
  broj --> [4],pbroj.
  broj --> [5],pbroj.
  broj --> [6],pbroj.
  broj --> [7],pbroj.
  broj --> [8],pbroj.
  broj --> [9],pbroj.

  pbroj --> [].
  pbroj --> broj.
#+end_src

#+RESULTS:
: true.

*** BKG++
- "trik" sa dodatnim varijablama nam moze pomoci u prepoznavanju jezika koji nisu u BK
- npr. jezik  \( {a^n b^n c^n, n \in N_+ } \)
  #+begin_src prolog :tangle ./bkg_pp.pl :session :goal s(succ(succ(succ(0))), X, [])
    s(Count) --> ablok(Count),bblok(Count),cblok(Count).

    ablok(0) --> [].
    ablok(succ(Count)) --> [a],ablok(Count).

    bblok(0) --> [].
    bblok(succ(Count)) --> [b],bblok(Count).

    cblok(0) --> [].
    cblok(succ(Count)) --> [c],cblok(Count).

  #+end_src

  #+RESULTS:
  | X = [a | a | a | b | b | b | c | c | c]. |
